import React, { useState } from 'react'

import CategoryUl from './CategoryUl';
export default function CategoryItems() {
    let categorys = {
        "تنقلات": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "لوازم تحریر": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "ادامس": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "نسکافه": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "کافی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "نا کافی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "مضر": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "بهداشتی  ": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "سلامتی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "پاکیزگی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "کنسرویجات  ": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "ماشینی  ": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "خونگی  ": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "پاک": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "گوشت": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "مرغ": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "شوینده": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "محصولات سلولزی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "نوشیدنی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "کالا های اساسی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "شوینده و مواد ضد عفونی کننده": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "سفید کننده": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        }
    }
    const categoryKeys = Object.keys(categorys)
    const [slectedCategory, setSlectedCategory] = useState(categoryKeys[0])
    // console.log(slectedCategory)
    return (
        <>
            <div className='w-[768px] flex max-h-[400px] min-h-[400px] z-50 bg-white backdrop-blur-[100px] rounded-lg' style={{ boxShadow: "0px 30px 70px rgba(0,0,0,0.4) " }}>

                <ul dir='ltr' className='min-h-full min-w-fit child:text-[14px] child:font-DanaMedium border-l border-gray-400/50 child:cursor-pointer child:w-full child:flex   child:items-center overflow-y-scroll flex flex-col  divide-y divide-gray-400/50 child:p-1 child:pl-3'>
                    {
                        categoryKeys.map((category, index) => (
                            <li className={`${slectedCategory === category ? "text-orange-400" : ""}`} dir='rtl' key={index} onMouseEnter={() => setSlectedCategory(category)}>  {category} </li>
                        ))
                    }
                </ul>
                <div className='w-full'>
                    <CategoryUl categorys={categorys[slectedCategory]} title={slectedCategory} />
                </div>
            </div>
        </>

    )
}
