import React, { useState } from 'react';

const SideCategoryItems = () => {
  let data = {
    "تنقلات": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "لوازم تحریر": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "ادامس": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "نسکافه": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "کافی": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "نا کافی": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "مضر": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "بهداشتی  ": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "سلامتی": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "پاکیزگی": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "کنسرویجات  ": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "ماشینی  ": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "خونگی  ": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "پاک": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "گوشت": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "مرغ": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "شوینده": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "محصولات سلولزی": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "نوشیدنی": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "کالا های اساسی": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
    },
    "شوینده و مواد ضد عفونی کننده": {
        "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
        "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
        "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        "سفید کننده": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
    }
}
  // مدیریت حالت باز و بسته بودن کلیدها
  const [openKeys, setOpenKeys] = useState({});

  const toggleKey = (key) => {
    setOpenKeys((prev) => ({
      ...prev,
      [key]: !prev[key],
    }));
  };

  const renderList = (obj, parentKey = '') => (
    <ul className="pl-5 ">
      {Object.entries(obj).map(([key, value]) => {
        const isNested = typeof value === 'object' && !Array.isArray(value);
        const isOpen = openKeys[`${parentKey}${key}`];

        return (
          <li key={key} className="my-2 bg-blue-500 font-DanaDemiBold text-base">
            <div
              className="cursor-pointer"
              onClick={() => isNested && toggleKey(`${parentKey}${key}`)}
            >
              {key}
            </div>
            {isOpen && isNested && renderList(value, `${parentKey}${key}.`)}
            {!isNested && (
              <ul className="text-[10px] bg-red-400 pl-5">
                {value.map((item, index) => (
                  <li key={index} className="text-gray-700">{item}</li>
                ))}
              </ul>
            )}

          </li>
        );
      })}
    </ul>
  );

  return <div>{renderList(data)}</div>;
};

export default SideCategoryItems;