import React, { useState } from 'react'
import SideCategoryItems from './SideCategoryItems'
import { IoClose } from "react-icons/io5";
import { FaAngleLeft } from "react-icons/fa6";
export default function SlideCategory({ sideCategoryHandler }) {
    let data = {
        "تنقلات": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "لوازم تحریر": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "ادامس": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "نسکافه": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "کافی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "نا کافی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "مضر": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "بهداشتی  ": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "سلامتی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "پاکیزگی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "کنسرویجات  ": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "ماشینی  ": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "خونگی  ": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "پاک": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "گوشت": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "مرغ": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "شوینده": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "محصولات سلولزی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "نوشیدنی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "کالا های اساسی": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
        },
        "شوینده و مواد ضد عفونی کننده": {
            "چیپس": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "پفک": ["ساده", "حلقه ای", "توپی", "نمکی "],
            "شکلات": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "پنبه": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
            "نخود": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "پیاز جعفری", , "پیاز جعفری", , "پیاز جعفری",],
            "هویج": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده", "ساده", "ساده", "ساده"],
            "سفید کننده": ["گوجه ای", "سرکه ای", "فلفلی", "پیاز جعفری", "ساده"],
        }
    }
    const [selectedMainCategory, setSelectedMainCategory] = useState(null);
    const setSelectedMainCategoryHandler = (categoryTitle) => {
        setSelectedMainCategory(prev => prev === categoryTitle ? null : categoryTitle)
    }
    const [selectedCategory, setSelectedCategory] = useState(null);
    const setSelectedCategoryHandler = (categoryTitle) => {
        setSelectedCategory(prev => prev === categoryTitle ? null : categoryTitle)
    }
    const [selectedCategoryChild, setSelectedCategoryChild] = useState(null);
    const categoryList = [];
    const ulMainCat = () => {
        let keys = []
        if (selectedMainCategory !== null) {
            keys = Object.keys(data[selectedMainCategory])
        }
        return keys
    }
    const ulCat = () => {
        let keys = []
        if (selectedCategory !== null) {
            keys = data[selectedMainCategory][selectedCategory];
        }
        console.log(keys)
        return keys
    }
    return (
        <div dir='rtl' className='flex fixed z-50 min-w-full min-h-screen  bg-zinc-500/50' >
            <div className='min-h-screen md:w-[570px] bg-white shadow-lg'>
                <div className='flex justify-between items-center'>
                    <span className='text-2xl font-MorabbaBold m-5' >دسته بندی ها </span>
                    <IoClose className='size-7 m-5 cursor-pointer' onClick={() => sideCategoryHandler()} />
                </div>
                <ul dir='ltr' className='pr-4 w-full space-y-3 overflow-y-scroll max-h-screen pb-3 text-base'>
                    {
                        Object.keys(data).map((categoryTitle, index) => (
                            <li dir='ltr' className='flex flex-col items-end' key={index}>
                                <span onClick={() => setSelectedMainCategoryHandler(categoryTitle)} className={`${selectedMainCategory === categoryTitle ? "text-orange-400" : ""} flex items-center w-full justify-between font-DanaDemiBold pl-6`}>
                                    <FaAngleLeft className={`${selectedMainCategory === categoryTitle ? "-rotate-90" : ""}`} />
                                    {categoryTitle}
                                </span>
                                <ul className={`${selectedMainCategory === categoryTitle ? "flex" : "hidden"} flex-col gap-y-1 mt-1 w-full pl-9 pr-3 `} >
                                    {
                                        ulMainCat().map((item, index) => (
                                            <li className=' w-full' key={index}>
                                                <span onClick={() => setSelectedCategoryHandler(item)} className={`${selectedCategory === item ? "text-orange-400" : ""} flex items-center justify-between w-full`}>
                                                    <FaAngleLeft className={`${selectedCategory === item ? "-rotate-90" : ""} size-3`} />
                                                    {item}
                                                </span>
                                                <ul dir='rtl'  className={`${selectedCategory === item ? "flex" : "hidden"} list-disc flex-col w-full pl-9 pr-6 text-sm space-y-1 mt-1 text-zinc-600 `}>
                                                    {
                                                        ulCat().map((child, index) => (
                                                            <li key={index}>
                                                                <span className='flex items-center w-full'>
                                                                    {child}
                                                                </span>
                                                            </li>
                                                        ))
                                                    }
                                                </ul>
                                            </li>
                                        ))
                                    }
                                </ul>
                            </li>
                        ))
                    }
                </ul>
                <div>

                </div>
            </div>
        </div>
    )
}
